src/Catalogs/Currencies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>Currencies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Symbol</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultARAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultAPAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultAccruedPurchasesAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Currencies/Forms/ItemForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Items.ARAccountLabel.Title = GeneralFunctions.GetAttributeValue(Object.DefaultARAccount, "Description");
	Items.APAccountLabel.Title = GeneralFunctions.GetAttributeValue(Object.DefaultAPAccount, "Description");
	Items.AccruedPurchasesLabel.Title = GeneralFunctions.GetAttributeValue(Object.DefaultAccruedPurchasesAccount, "Description");

	
EndProcedure

&AtClient
Procedure DefaultARAccountOnChange(Item)
	
		Items.ARAccountLabel.Title = GeneralFunctions.GetAttributeValue(Object.DefaultARAccount, "Description");

EndProcedure

&AtClient
Procedure DefaultAPAccountOnChange(Item)
	
		Items.APAccountLabel.Title = GeneralFunctions.GetAttributeValue(Object.DefaultAPAccount, "Description");

EndProcedure

&AtClient
Procedure BeforeWrite(Cancel, WriteParameters)
	DoMessageBox("Fill in default A/R, A/P, and Accrued Purchases accounts after adding a new currency");
EndProcedure

&AtClient
Procedure DefaultAccruedPurchasesAccountOnChange(Item)
		Items.AccruedPurchasesLabel.Title = GeneralFunctions.GetAttributeValue(Object.DefaultAccruedPurchasesAccount, "Description");
EndProcedure
